# coding=UTF-8
import pkuseg
lexicon = ['北京大学', '北京天安门']
seg = pkuseg.pkuseg(user_dict=lexicon,model_name='./data')				#以默认配置加载模型
text = seg.cut('台军计划本月在台中进行“联合反登陆”演习。不过台媒报道称，有台湾网友日前去阵地观察，发现台军为轻兵器射击阵地堆置清一色的白色沙包，并批评这种做法破坏隐蔽，成为吸引火力的标靶，“简直不可思议”“过家家”。事件被台媒报道后引来又一波批评，有人直接讽刺：童子军扎营。')	#进行分词
print(text)

# loading model
# finish
# ['台军', '计划', '本月', '在', '台中', '进行', '“', '联合', '反', '登陆', '”', '演习', '。', '不过', '台媒', '报道', '称', '，', '有', '台湾', '网友', '日前', '去', '阵地', '观察', '，', '发现', '台军', '为', '轻兵器', '射击', '阵地', '堆置', '清', '一', '色', '的', '白色', '沙包', '，', '并', '批评', '这', '种', '做法', '破坏', '隐蔽', '，', '成为', '吸引', '火力', '的', '标靶', '，', '“', '简直', '不可思议', '”', '“', '过家家', '”', '。', '事件', '被', '台媒', '报道', '后', '引来', '又', '一', '波', '批评', '，', '有', '人', '直接', '讽刺', '：', '童子军', '扎营', '。']